{
  "experiences": [
    {
      "id": "course-development-assistant",
      "title": "Course Development Assistant",
      "company": "University of Glasgow",
      "startDate": "2024-05",
      "endDate": "2024-09",
      "detail": "I was disappointed with the course content of one of my second year courses, Networked Systems. I reached out to my lecturer after the course offering my honest, non-anonymous feedback.\n\nIt was his first year taking the course and he asked if I could help during the summer to revamp and modernise the course. We worked closely together to redesign lecture slides, create weekly quizzes, and develop extended supplementary notes to aid future students with their learning.",
      "skills": [
        "Networked Systems",
        "Sockets Programming",
        "PowerPoint",
        "Communication",
        "Adaptive"
      ],
      "type": "experience",
      "category": "Work Experience",
      "relevance": 3
    },
    {
      "id": "jp-morgan",
      "title": "Software Engineer Industrial Placement",
      "company": "JP Morgan Chase",
      "startDate": "2025-06",
      "endDate": "2026-06",
      "detail": "As part of my degree, I have been part of a year-long placement at the Glasgow Technology Centre of JPMorganChase. I could not have hoped for more in my learning.\n\nMy main project so far has been migrating a legacy file upload system for financial documents to the cloud. I own the UI portion of the project and so far I have designed, implemented, and deployed modernised screens that are now in the hands of business users.\n\nI have worked closely with stakeholders, adapted designs to changing requirements, and created feature-rich pages with powerful tools to visualise and filter data.\n\nThis role has been a complete change to my life - I have taken up much more sport, got into an actual cooking routine, and learned to appreciate free time a lot more. I am grateful to JP for all their efforts in making settling in a lot easier than I thought it would be.\n\nI have worked with a wonderful group of 12 IPs and going through this journey with them has made it all the more enjoyable.",
      "skills": [
        "React",
        "TypeScript",
        "Python",
        "AWS",
        "Databricks",
        "Terraform",
        "Node.js",
        "Mobile Development",
        "Figma",
        "UI/UX",
        "Design",
        "Technical Problem Solving",
        "Teamwork",
        "Communication",
        "Adaptive"
      ],
      "type": "experience",
      "category": "Work Experience",
      "relevance": 5
    },
    {
      "id": "guss",
      "title": "Software Developer",
      "company": "Glasgow University Software Service",
      "startDate": "2024-10",
      "endDate": "2025-06",
      "detail": "During my third year of university, I worked with the university's software team on a web application for the MVLS college. Balancing my work with my studies, I delivered weekly features in an agile development cycle.\n\nI was most proud of building an Editable FAQ Page for super admins - the edit mode was rich in features. It allowed for the creation of sections, paragraphs, and tables in an easy-to-use way, and when saved would be pushed to the database that was then reflected for all users.\n\nIt took a lot of work but was very satisfying to see come together.",
      "skills": [
        "JavaScript",
        "Technical Problem Solving",
        "Communication",
        "Docker",
        "Django",
        "Agile"
      ],
      "type": "experience",
      "category": "Work Experience",
      "relevance": 4
    },
    {
      "id": "hgi-exp",
      "title": "Food & Beverages Assistant",
      "company": "Hilton Garden Inn Glasgow",
      "startDate": "2023-06",
      "endDate": null,
      "detail": "My last stint in hospitality - I have thoroughly enjoyed working with the Hilton. Surrounded by a great team, we always delivered friendly and effective service.\n\nThe Hilton is definitely a fast paced environment and we had some insanely hectic shifts that have delivered some fantastic hospitality stories.",
      "skills": [
        "Teamwork",
        "Communication",
        "Adaptive"
      ],
      "type": "experience",
      "category": "Work Experience",
      "relevance": 2
    },
    {
      "id": "luxford-exp",
      "title": "Front of House Burger Van",
      "company": "Luxford Burgers",
      "startDate": "2023-08",
      "endDate": "2023-08",
      "detail": "Probably the most insane month of my life. I worked 28 days in a row, pulling four back-to-back 80-hour weeks.\n\nWorking in a food van at the Edinburgh Fringe was definitely an experience I will never regret - but also not repeat quickly.\n\nI will also die on the hill that Luxford's burgers are sensational and if you are ever in Edinburgh, do your best to go and try them.",
      "skills": [
        "Teamwork",
        "Communication",
        "Adaptive",
        "Sales"
      ],
      "type": "experience",
      "category": "Work Experience",
      "relevance": 1
    },
    {
      "id": "spotify-we",
      "title": "Marketing Work Experience",
      "company": "Spotify",
      "startDate": "2021-02",
      "detail": "I worked in a team of 5 to come up with a marketing campaign for a new movie that was a partnership between Spotify and Netflix. In the end, we presented to around 400 people - this was terrifying to me at the time but a huge confidence booster.\n\nWe ended up winning the category for the Most Unique Idea! I was really proud of this experience; especially being in Covid, I hadn't had many opportunities like this.\n\nIt's also clear I did not go down the marketing route! But it is nice to have experience in non-tech areas.",
      "skills": [
        "Communication",
        "Teamwork",
        "Leadership",
        "Presenting"
      ],
      "type": "experience",
      "category": "Work Experience",
      "endDate": "2021-02",
      "relevance": 1
    },
    {
      "id": "comp-club",
      "title": "Computing Club Leader",
      "company": "Boroughmuir High School",
      "startDate": "2021-08",
      "detail": "In our final year of high school, our Computing class ran a lunchtime Computing Club for first years as part of our Young STEM Leader awards. \n\nWe taught the kids basic Python programming, taught them how to make their first websites and really brought a buzz around computing for them. Our attendance throughout the year of the club never dropped below what it started - in fact the club only seemed to grow!\n\nWe had a lot of fun running the club and seeing how enthusiastic the kids were. To be able to inspire them and kickstart their learning in programming was and still is very special to me. \n\nTwo years later, my computing teacher reached out to share that Computer Science enrollment hit a record high the year members from our club were choosing their courses. I was delighted to have played a role in encouraging more young people into Computing - and hopefully they retained some of the fundamentals we taught them!\n\nIn the end, I also received my Young STEM Leader award as part of my efforts in organising and leading the club.",
      "skills": [
        "Leadership",
        "Teamwork",
        "PowerPoint",
        "Presenting",
        "Communication"
      ],
      "type": "experience",
      "category": "Work Experience",
      "endDate": "2022-04",
      "relevance": 4
    }
  ],
  "projects": [
    {
      "id": "team-project",
      "title": "University Team Project",
      "company": "Thales",
      "startDate": "2024-09",
      "endDate": "2025-04",
      "detail": "This is a project I am truly proud of. As part of a third year university course, six of us worked together for Thales UK to build an AI Map Generation Desktop App - Map Genie.\n\nThe concept was simple - the user inputs a plain English prompt on the UI, customises the styling of the map, and then a map opens in QGIS (map software) with the result of their query highlighted and the map nicely styled. An example use case would be 'Police stations in a 5-mile radius around Wembley Stadium'.\n\nI was our Product Owner which meant working frequently with our client to ensure our app was progressing aligned to his requirements. I also delivered the PyQGIS service of the project which included taking the result of the query and rendering the map in QGIS programmatically.\n\nI also built offline maps functionality where the user could save their QGIS map for offline use - a feature that required sockets programming to send and receive requests to QGIS from our front end.\n\nThis project also resulted in my greatest academic achievement to date: winning the Team Project award for our year group (the top six of 400 students).",
      "skills": [
        "Project Management",
        "Teamwork",
        "Communication",
        "Leadership",
        "React",
        "TypeScript",
        "GIS Software",
        "Python",
        "Databases",
        "Sockets Programming"
      ],
      "type": "project",
      "category": "Projects",
      "relevance": 5
    },
    {
      "id": "cereal-site",
      "title": "Cereal Webscraping Site",
      "company": "Boroughmuir High School",
      "startDate": "2021-08",
      "detail": "I love cereal. Maybe not as much as I used too, but I think was known throughout high school by friends and family for loving cereal. \n\nAs part of Advanced Higher Computing, we had a build a project adopting full agile methodology that incorporated at least two of Databases, Web Dev and Python. \n\nI took all 3 and built a webscraping script in Python to query the main 4 UK supermarkets and save their deals to a DB, then I built an intuitive UI for searching, filtering and sorting cereal deals. \n\nThis project was entirely pre-AI - back when if people got stuck StackOverflow was the go-to. I am extremely proud of this project and I was rewarded with an exceptional mark in the course. \n\nUnfortunately, the source code for this resides on a password-protected USB stick so I could access it on school computers. This password is completely lost to me - but I still have the 173 pages of documentation, so if you are interested I'd be happy to share!",
      "skills": [
        "Agile",
        "Python",
        "Technical Problem Solving",
        "UI/UX",
        "Databases"
      ],
      "type": "project",
      "category": "Projects",
      "endDate": "2022-04",
      "relevance": 2
    },
    {
      "id": "web-app-tp",
      "title": "Web App Team Project",
      "company": "University of Glasgow",
      "startDate": "2024-01",
      "detail": "As part of my second year Web App Development course, I was placed in a team of 6 and challenged to design, implement and deploy a web app within 3 months. My team created a site to aid people with Exploring Glasgow - coming with an Events page, Activities page and a Scheduling tool. \n\nDespite having to use Django as part of the course (truly not my favourite technology), we excelled in the project. Our presentation (albeit very last minute) went exceptionaly well. To this day, this course is my highest mark at university so far (see /compsci-2006).",
      "skills": [
        "Teamwork",
        "Communication",
        "Technical Problem Solving",
        "Django",
        "UI/UX",
        "Design",
        "Databases"
      ],
      "type": "project",
      "category": "Projects",
      "endDate": "2024-03",
      "relevance": 3,
      "link": {
        "url": "https://github.com/calilak/explore_glasgow_project",
        "label": "GitHub Link"
      }
    }
  ],
  "education": [
    {
      "id": "compsci1001-education",
      "title": "Computing Science 1P - COMPSCI1001",
      "company": "University of Glasgow",
      "startDate": "2022-09",
      "endDate": "2023-05",
      "dateRange": "Grade: A4",
      "detail": "My main course in first year of university - a programming fundamentals course primarily taught in Python but more focused on teaching general core concepts.",
      "skills": [
        "Python",
        "Object Oriented Programming",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI1001",
        "label": "Course Specification"
      },
      "relevance": 2
    },
    {
      "id": "compsci1006-education",
      "title": "Computing Fundamentals - COMPSCI1006",
      "company": "University of Glasgow",
      "startDate": "2022-09",
      "endDate": "2023-05",
      "dateRange": "Grade: A5",
      "detail": "A fundamentals course mainly focusing on the core concepts of human computer interaction. We completed an HCI evaluation of an application by assessing where it lacked in quality of design and we would redesign it.\n\nWe also were taught the fundamentals of databases and SQL.",
      "skills": [
        "Design",
        "Databases",
        "UI/UX"
      ],
      "type": "education",
      "category": "Education",
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI1006",
        "label": "Course Specification"
      },
      "relevance": 1
    },
    {
      "id": "compsci-1018",
      "title": "Computer Systems - COMPSCI1018",
      "company": "University of Glasgow",
      "startDate": "2023-01",
      "detail": "A course focussing on Computer Hardware. Not one of my best results in courses but no doubt, a very interesting and different course to what I was used to. \n\nThe coursework for this course involved writing programs in Assembly which I did very well in - it was the exam that let me down.",
      "skills": [
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2023-05",
      "dateRange": "Grade: C1",
      "relevance": 1,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI1018",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-2001",
      "title": "Introduction to Object Orientated Programming - COMPSCI2001",
      "company": "University of Glasgow",
      "startDate": "2023-09",
      "detail": "I find object orientated programming to be a genuinely enjoyable programming paradigm which uses a lot of problem solving. This course was a great introduction and set us up very well for the follow on Object Orientated Software Engineering course.",
      "skills": [
        "Object Oriented Programming",
        "Technical Problem Solving",
        "Java"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2023-12",
      "dateRange": "Grade: B2",
      "relevance": 2,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI2001",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-2003",
      "title": "Algorithmic Foundations - COMPSCI2003",
      "company": "University of Glasgow",
      "startDate": "2023-09",
      "detail": "Quite a maths based course, this focused on proving the correctness of algorithms as well as rules of inference, graphs and matrices.\n\nThis course was tricky but taught by two of the best lecturers at Glasgow Uni which definitely helped. I don't think I was committed enough to doing well in this course as I fully feel the A was within grasp.",
      "skills": [
        "Java"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2023-12",
      "dateRange": "Grade: B2",
      "relevance": 2,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI2003",
        "label": "Course Specification"
      }
    },
    {
      "id": "sqa-advh-cs",
      "title": "SQA Advanced Higher Computing Science",
      "company": "Boroughmuir High School",
      "startDate": "2021-08",
      "detail": "The course that reassured my choice of taking Computing at university. This was just a lot of fun, we worked on projects throughout the course. I built a cereal webscraping site for finding the best deals at UK supermarkets. You can check more detail out on that following the project link.\n\nThis was also the year we ran the Computing Club for first years - a weekly lunchtime club where we taught 12-13 year olds the basics of programming. It was a monumentously successful club with the best turnout it had ever had - and two years later our hard work was rewarded with record uptake of Computing Science at a National 5 level (when the kids we taught were making their course choice).\n\nIt was a year filled with a lot of learning and a lot of fun. A massive shoutout to our teacher Mrs Dighton who is now enjoying retirement; she was a great teacher and a great laugh!",
      "skills": [
        "Python",
        "Databases",
        "Object Oriented Programming",
        "Agile",
        "Software Engineering",
        "Leadership",
        "Communication",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2022-05",
      "dateRange": "Grade: A1",
      "relevance": 1,
      "link": {
        "url": "/content/cereal-site",
        "label": "Cereal Project"
      }
    },
    {
      "id": "compsci-2007",
      "title": "Algorithms & Data Structures - COMPSCI2007",
      "company": "University of Glasgow",
      "startDate": "2024-01",
      "detail": "By far the biggest disappointment in my academic career so far. I really blundered this exam. I found out my grades while on a train from Prague to Berlin interrailing - and it was kind of more shock rather than any other emotion.\n\nThe course was definitely challenging - but these were two things that I had been good at throughout CS. I knew I had an Algorithms course in third year so I ensured I properly learnt, prepped and studied for that and walked away with an \tA4. \n\nALthough a low point in university, I know I built a lot on this. Before my grades properly mattered in third year, I feel I benefitted from getting a kick that I couldn't coast these much harder years.",
      "skills": [
        "Resilience",
        "Java",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2024-05",
      "dateRange": "Grade: D1",
      "relevance": 2,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI2007",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-2008",
      "title": "Object Orientated Software Engineering  - COMPSCI2008",
      "company": "University of Glasgow",
      "startDate": "2024-01",
      "detail": "A follow on from the Intro to OOP course. I really liked this course. It focussed mainly on object orientated design patterns which I found incredibly interesting.\n\nThe coursework went very well - we were given a problem and told to use design patterns to implement our solution. A lot of my programming ability can be attributed to this course.",
      "skills": [
        "Object Oriented Programming",
        "Java",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2024-05",
      "dateRange": "Grade: B1",
      "relevance": 2,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI2008",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-2021",
      "title": "Web Application Development - COMPSCI2021",
      "company": "University of Glasgow",
      "startDate": "2024-01",
      "detail": "My joint best grade so far at university - this course was definitely not my favourite in terms of what we were taught (it was quite outdated) but the team project that accompanied it was very good. \n\nWe built a site to aid users in making the most of their time in Glasgow. I particularly focused on building a scheduling system which allowed users to plan out their days with events and activities we had on the site. \n\nI also designed the site and wrote most of the styling. We also had to create a video presentation which turned into a frantic last minute submission (I'd rather not get into that), but despite submitting 8 minutes before the deadline - we got an excellent grade.",
      "skills": [
        "Leadership",
        "JavaScript",
        "Presenting",
        "Django",
        "Teamwork",
        "Communication",
        "PowerPoint"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2024-05",
      "dateRange": "Grade: A2",
      "relevance": 2,
      "link": {
        "url": "https://github.com/calilak/explore_glasgow_project",
        "label": "Project GitHub"
      }
    },
    {
      "id": "compsci-2024",
      "title": "Networks & Operating Systems Essentials",
      "company": "University of Glasgow",
      "startDate": "2023-09",
      "detail": "In a strange way this is one of my lowest grades at university so far despite now being two of my strongest subject areas. In brutal honesty, this course was a mess at the time. Trying to cram two of the biggest areas of computing into 11 short weeks was a recipe for disaster.\n\nAfter the course, this was when I reached out to my lecturer for the networks side of the course who agreed with the flaws I had pointed out. I then proceeded to work with him throughout the Summer of 2024 to improve and enhance both the course content and material.\n\nIn doing so, I actually gained a lot more understanding in networked systems and I am now planning on doing my fifth year dissertation on something within the subject.",
      "skills": [
        "Sockets Programming",
        "Technical Problem Solving",
        "Python"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2023-12",
      "dateRange": "Grade: C3",
      "relevance": 2,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI2024",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4009",
      "title": "Algorithmics I - COMPSCI4009",
      "company": "University of Glasgow",
      "startDate": "2024-09",
      "detail": "An academic comeback for me. After a really disappointing result in my ADS course in 2nd year, I was determined to ensure this went well. I put a lot of time into studying this course - and this was helped by having one of the best lecturers at Glasgow, Gethin. \n\nI was delighted with this grade. The course itself was very interesting: we studied graphing algorithms, string matching algorithms, NP completness and finally Automata and Turing Machines. Definitely challenging but satisfying to gradually improve at.",
      "skills": [
        "Java",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2024-12",
      "dateRange": "Grade: A4",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4009",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4011",
      "title": "Operating Systems - COMPSCI4011",
      "company": "University of Glasgow",
      "startDate": "2025-01",
      "detail": "This course was genuinely really interesting. Despite the 2 hour Monday 9am lectures, the lecturer Paul Harvey was engaging and taught the content well. The coursework was not very well defined, but turned out to be one of the most satisfying pieces.\n\nWe implemented a multithreaded signals processing systems for creating child processes from parent processes and signalling to communicate between them. I ended up doing very well in this despite spending over 40 hours on an assignment that was supposed to take me 10.",
      "skills": [
        "C",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2025-05",
      "dateRange": "Grade: A3",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4011",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4012",
      "title": "Networked Systems - COMPSCI4012",
      "company": "University of Glasgow",
      "startDate": "2025-01",
      "detail": "A thoroughly interesting course and taught in great depth by our lecturer, Colin Perkins. This course was tough and was marked harshly but is definitely an area of computing I have a lot of interest in. \n\nI plan to do my final year dissertation next year on some area of Networked Systems - potentially investigating TCP congestion control or the politics of the network. \n\nI was very happy with my B1 but I know from seeing my grade breakdown that I was one mark off an A which is a little gutting.",
      "skills": [
        "Sockets Programming",
        "Networked Systems",
        "Python",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2025-05",
      "dateRange": "Grade: B1",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4012",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4014",
      "title": "Human Centred Systems, Design & Evaluation - COMPSCI4014",
      "company": "University of Glasgow",
      "startDate": "2024-09",
      "detail": "The less said here the better. Not my favourite course at university by a long shot. Very dull content with very dull material. I probably should have done better in the course but I think I focused too much of my effort on succeeding in Algorithmics. \n\nWe did do two team projects as part of the coursework which were actually pretty decent. I learnt Figma for the first time, conducted semi structured interviews, created user surveys and we designed a proof of concept for an app to help students to manage their time. I excelled in the coursework but the exam did not go so well...",
      "skills": [
        "Design",
        "Figma",
        "Teamwork",
        "Presenting"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2024-12",
      "dateRange": "Grade: C1",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4014",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4015",
      "title": "Professional Software Development - COMPSCI4015",
      "company": "University of Glasgow",
      "startDate": "2024-09",
      "detail": "Definitely not the highest standard of course material and I think our lecturer wouldn't object to me saying that, but PSD was still a solid course. We were taught Version Control, Project Management, Requirements Gathering, CI/CD, Software Architecture, Infrastructure as Code and Start Up Growth Engineering. \n\nAs you can see, some very meaty topics. I spoke to our lecturer after the course who agreed that it needs to be split up more and perhaps the software design content should be extracted into its own course.\n\nRegardless, the course was pretty good and I see myself using parts of it in my daily job.",
      "skills": [
        "Agile",
        "Project Management",
        "Docker",
        "Teamwork",
        "Software Engineering"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2025-05",
      "dateRange": "Grade: A5",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4015",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4016",
      "title": "Programming Languages - COMPSCI4016",
      "company": "University of Glasgow",
      "startDate": "2025-01",
      "detail": "This was a really interesting course. Very different to some of the other things I had done - it looked at what makes up a programming languages and how you can build one. It was taught by one of the best Computing lecturers at Glasgow, Simon Fowler who was always willing to answer questions and simplify tricky concepts. \n\nThe lecturers followed a linear structure where we essentially kept building upon a simple programming language eventually reaching topics like typechecking and recursion. I definitely enjoyed this course and will be sure to take Functional Programming in fifth year.",
      "skills": [
        "Technical Problem Solving",
        "Java"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2025-05",
      "dateRange": "Grade: B1",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4016",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4047",
      "title": "Team Project - COMPSCI4047",
      "company": "University of Glasgow",
      "startDate": "2024-09",
      "detail": "My biggest academic achievement to date so far - I can't really point a flaw in the team project course. Back in September 2024, we were put into teams and selected preferences from a sheet of potential clients. My team began working with Thales UK on an AI-powered GIS Map Generation app. \n\nWe dealt with changing requirements, illness within the team, and fully new technologies to us. I was privileged to work with 5 fantastic teammates and collectively we delivered an application that we could be very proud of. It went above and beyond our clients expectations and also gave us a great grade in the course. \n\nWithin the team, I operated as our Product Owner and took leadership of quality assurance, requirements gathering and ticket management. On the coding side, I owned the QGIS component of our app including automating the opening and rendering of the map in QGIS, offline map downloads and handling styling of the map. \n\nEssentially all the work I did was entirely new to me. The course has been incredibly helpful since I have started at JPMorgan. I think my manager was pretty surprised that I was competent with Git and Jira. \n\nThe problem solving involved with the QGIS integration was very satisfying - I particularly enjoyed using sockets programming to communicate from QGIS to our front end to receive a request to generate an offline map. Our client was not sure if the offline map feature was possible but the team and I took it from an idea to a delivered feature.\n\nIn reward of our efforts, the team and I won the award for the highest grade in Team Project for our yeargroup (out of 40 teams). It was a delight to work with the team and I cannot thank them enough for their hard work throughout.",
      "skills": [
        "Communication",
        "Teamwork",
        "Software Engineering",
        "Agile",
        "Project Management",
        "Docker",
        "TypeScript",
        "Presenting",
        "Node.js",
        "Python",
        "Sockets Programming",
        "Adaptive",
        "Figma",
        "React"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2025-04",
      "dateRange": "Grade: A2",
      "relevance": 4,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4047",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4062",
      "title": "Cyber Security Fundamentals - COMPSCI4062",
      "company": "University of Glasgow",
      "startDate": "2025-01",
      "detail": "This was another pretty solid course. We learnt about Intrusion Detection Systems, Firewalls, Cryptography and Password Protection. It turned out to be a lot more maths heavy than I expected but it was still a very interesting course.",
      "skills": [
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2025-05",
      "dateRange": "Grade: A4",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4062",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4073",
      "title": "Data Fundamentals - COMPSCI4073",
      "company": "University of Glasgow",
      "startDate": "2024-09",
      "detail": "The most challenging course I've done so far academically. The course was very interesting but so so difficult. When tracking my revision, I did double the amount of revision for DF than I did for my second most revised course. \n\nThe course essentially was a mathsy problem solving course in a computing context. It covered with floating point, visualising data, linear algebra, optimisation, probability and finally time series and signals. \n\nA great course but I am happy to see it behind me.",
      "skills": [
        "Technical Problem Solving",
        "Python"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2024-12",
      "dateRange": "Grade: B2",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4073",
        "label": "Course Specification"
      }
    },
    {
      "id": "compsci-4081",
      "title": "Systems Programming - COMPSCI4081",
      "company": "University of Glasgow",
      "startDate": "2025-01",
      "detail": "A fairly self explanatory course. This explored low level programming. We were first taught C and pointers followed by multithreading and concurrency using C++. \n\nI definitely enjoyed this course and I enjoy the problem solving behind low level, performant languages. I look forward to the follow on to this course which delves into Rust.",
      "skills": [
        "C",
        "C++",
        "Technical Problem Solving"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2025-05",
      "dateRange": "Grade: A3",
      "relevance": 3,
      "link": {
        "url": "https://www.gla.ac.uk/coursecatalogue/course/?code=COMPSCI4081",
        "label": "Course Specification"
      }
    },
    {
      "id": "sqa-advh-maths",
      "title": "SQA Advanced Higher Maths",
      "company": "Boroughmuir High School",
      "startDate": "2021-08",
      "detail": "Probably when I peaked at Maths. Advanced Higher was really solid for teaching a lot of the core concepts I use in computing. Having a strong foundation in Calculus has been especially useful. \n\nMaths is hard though. Respect to anyone who did it as a degree.",
      "skills": [
        "Resilience"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2022-05",
      "dateRange": "Grade: A2",
      "relevance": 1
    },
    {
      "id": "sqa-advh-physics",
      "title": "SQA Advanced Higher Physics",
      "company": "Boroughmuir High School",
      "startDate": "2021-08",
      "detail": "Physics always really interested in me and if it had been taught slightly better at Glasgow Uni, I probably would have stuck with it longer. I had a fantastic teacher at High School and I wasn't the most naturally gifted Physicist but I made up for it with a lot of hard work. \n\nI was delighted in the end to get the A in Physics. Shame it didn't carry over into uni.",
      "skills": [
        "Resilience"
      ],
      "type": "education",
      "category": "Education",
      "endDate": "2022-05",
      "dateRange": "Grade: A2",
      "relevance": 1
    }
  ],
  "about": [
    {
      "id": "cooking",
      "title": "Cooking",
      "company": "Ollie",
      "startDate": null,
      "endDate": null,
      "detail": "I thought I may as well dedicate a page to it. Cooking has hugely grown on me and is something I find quite therapeutic after work.\n\nMy comfort dish to make is Creamy Chorizo & Halloumi Pasta - maybe not the most healthy but so quick and tasty.\n\nRecently some of my favourites to make have been Lamb Tagine, Paneer Makhani, a hearty Chicken Pasta Bake, and Kung Pao Chicken.\n\nCheck out the photo gallery for some food snaps!",
      "skills": [
        "Cooking"
      ],
      "type": "about",
      "category": "About",
      "relevance": 3,
      "photos": [
        {
          "caption": "Kung Pao Chicken",
          "filename": "kung-pao.jpg"
        },
        {
          "caption": "Chicken Pasta Bake",
          "filename": "chicken-pasta-bake.jpg"
        },
        {
          "caption": "Sticky Pork Belly",
          "filename": "pork-belly.jpg"
        },
        {
          "caption": "Chorizo and Feta Bake",
          "filename": "chorizo-bake.jpeg"
        }
      ]
    }
  ]
}